results/results_1/aggregated/out 512/test5-4img-rate1-total300-restarted/output.txt
[Thu Jul 23 07:03:45 AM UTC 2026] Waiting for http://aggregation-epp:80/v1/models ...
  Endpoint up.

[Thu Jul 23 07:03:45 AM UTC 2026] === Rate 1 ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
/sgl-workspace/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1920x1080) with 1200 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=512, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://aggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=512, random_range_ratio=1.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2493302
#Output tokens: 153600
#Total images: 1200
#Images per request: 4 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=38400
  Text prompt tokens (with chat template): avg=143.0, total=42902
  Text prompt overhead: avg=15.0, total=4502
  Vision tokens: avg=8168.0, total=2450400

Created 300 random jpeg images with average 8359354 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/300 [00:00<?, ?it/s]
  0%|          | 1/300 [00:17<1:25:10, 17.09s/it]
  1%|          | 2/300 [00:17<36:05,  7.27s/it]  
  1%|          | 3/300 [00:19<23:06,  4.67s/it]
  2%|▏         | 5/300 [00:33<29:29,  6.00s/it]
  2%|▏         | 6/300 [00:49<43:25,  8.86s/it]
  2%|▏         | 7/300 [00:49<31:41,  6.49s/it]
  3%|▎         | 8/300 [00:53<27:18,  5.61s/it]
  4%|▎         | 11/300 [00:53<12:05,  2.51s/it]
  4%|▍         | 13/300 [00:54<08:27,  1.77s/it]
  5%|▍         | 14/300 [00:58<10:27,  2.20s/it]
  5%|▌         | 15/300 [01:10<21:11,  4.46s/it]
  5%|▌         | 16/300 [01:12<18:04,  3.82s/it]
  6%|▌         | 18/300 [01:12<10:45,  2.29s/it]
  7%|▋         | 22/300 [01:12<05:00,  1.08s/it]
  8%|▊         | 24/300 [01:15<05:40,  1.23s/it]
  8%|▊         | 25/300 [01:16<05:02,  1.10s/it]
  9%|▉         | 27/300 [01:17<03:57,  1.15it/s]
 10%|▉         | 29/300 [01:18<03:38,  1.24it/s]
 10%|█         | 31/300 [01:18<02:35,  1.73it/s]
 11%|█         | 33/300 [01:18<02:03,  2.17it/s]
 11%|█▏        | 34/300 [01:19<02:14,  1.98it/s]
 12%|█▏        | 36/300 [01:19<01:35,  2.77it/s]
 13%|█▎        | 38/300 [01:19<01:08,  3.80it/s]
 13%|█▎        | 40/300 [01:21<01:46,  2.44it/s]
 14%|█▎        | 41/300 [01:21<01:46,  2.43it/s]
 14%|█▍        | 43/300 [01:21<01:14,  3.47it/s]
 15%|█▍        | 44/300 [01:23<02:33,  1.66it/s]
 15%|█▌        | 46/300 [01:25<02:58,  1.42it/s]
 16%|█▌        | 47/300 [01:25<02:33,  1.65it/s]
 16%|█▌        | 48/300 [01:30<06:06,  1.46s/it]
 16%|█▋        | 49/300 [01:31<05:32,  1.33s/it]
 17%|█▋        | 50/300 [01:31<04:51,  1.17s/it]
 17%|█▋        | 51/300 [01:32<04:06,  1.01it/s]
 18%|█▊        | 53/300 [01:32<02:24,  1.71it/s]
 18%|█▊        | 55/300 [01:35<04:09,  1.02s/it]
 19%|█▉        | 57/300 [01:35<02:44,  1.48it/s]
 20%|█▉        | 59/300 [01:35<01:52,  2.14it/s]
 21%|██        | 63/300 [01:36<01:00,  3.94it/s]
 22%|██▏       | 66/300 [01:38<01:30,  2.58it/s]
 23%|██▎       | 69/300 [01:38<01:02,  3.67it/s]
 24%|██▍       | 73/300 [01:38<00:41,  5.48it/s]
 25%|██▌       | 75/300 [01:39<00:50,  4.43it/s]
 26%|██▌       | 77/300 [01:40<01:19,  2.80it/s]
 26%|██▋       | 79/300 [01:41<01:22,  2.67it/s]
 27%|██▋       | 80/300 [01:44<02:33,  1.43it/s]
 27%|██▋       | 81/300 [01:44<02:11,  1.66it/s]
 27%|██▋       | 82/300 [01:45<03:05,  1.18it/s]
 28%|██▊       | 83/300 [01:46<03:03,  1.18it/s]
 29%|██▊       | 86/300 [01:48<02:16,  1.57it/s]
 30%|██▉       | 89/300 [01:54<04:25,  1.26s/it]
 30%|███       | 90/300 [01:57<05:28,  1.56s/it]
 31%|███       | 92/300 [01:58<04:07,  1.19s/it]
 31%|███▏      | 94/300 [02:01<04:42,  1.37s/it]
 32%|███▏      | 96/300 [02:02<03:16,  1.04it/s]
 33%|███▎      | 99/300 [02:02<02:00,  1.66it/s]
 34%|███▎      | 101/300 [02:07<04:01,  1.21s/it]
 34%|███▍      | 102/300 [02:10<04:38,  1.41s/it]
 35%|███▍      | 104/300 [02:10<03:23,  1.04s/it]
 36%|███▌      | 107/300 [02:10<02:02,  1.58it/s]
 37%|███▋      | 111/300 [02:11<01:10,  2.68it/s]
 38%|███▊      | 113/300 [02:18<03:34,  1.15s/it]
 38%|███▊      | 113/300 [02:30<03:34,  1.15s/it]
 38%|███▊      | 114/300 [02:32<09:21,  3.02s/it]
 39%|███▊      | 116/300 [02:32<06:35,  2.15s/it]
 40%|███▉      | 119/300 [02:32<04:03,  1.34s/it]
 40%|████      | 121/300 [02:32<02:58,  1.00it/s]
 41%|████      | 123/300 [02:32<02:11,  1.35it/s]
 42%|████▏     | 125/300 [02:32<01:35,  1.83it/s]
 43%|████▎     | 128/300 [02:44<05:17,  1.85s/it]
 43%|████▎     | 129/300 [02:47<05:34,  1.96s/it]
 44%|████▎     | 131/300 [02:48<04:25,  1.57s/it]
 45%|████▍     | 134/300 [02:53<04:22,  1.58s/it]
 45%|████▌     | 136/300 [02:56<04:06,  1.50s/it]
 46%|████▌     | 138/300 [02:56<02:57,  1.10s/it]
 47%|████▋     | 140/300 [02:56<02:09,  1.24it/s]
 47%|████▋     | 141/300 [02:57<02:23,  1.11it/s]
 48%|████▊     | 143/300 [02:59<02:09,  1.21it/s]
 48%|████▊     | 145/300 [02:59<01:30,  1.72it/s]
 49%|████▉     | 147/300 [03:01<01:40,  1.52it/s]
 50%|████▉     | 149/300 [03:02<01:32,  1.64it/s]
 50%|█████     | 151/300 [03:02<01:05,  2.27it/s]
 51%|█████▏    | 154/300 [03:02<00:40,  3.58it/s]
 52%|█████▏    | 156/300 [03:02<00:43,  3.35it/s]
 53%|█████▎    | 158/300 [03:03<00:36,  3.89it/s]
 53%|█████▎    | 160/300 [03:03<00:40,  3.49it/s]
 54%|█████▍    | 163/300 [03:04<00:26,  5.09it/s]
 55%|█████▌    | 165/300 [03:06<01:06,  2.02it/s]
 55%|█████▌    | 166/300 [03:08<01:29,  1.49it/s]
 56%|█████▌    | 167/300 [03:08<01:15,  1.77it/s]
 56%|█████▌    | 168/300 [03:09<01:16,  1.73it/s]
 57%|█████▋    | 171/300 [03:09<00:41,  3.10it/s]
 58%|█████▊    | 174/300 [03:09<00:26,  4.75it/s]
 59%|█████▉    | 177/300 [03:09<00:18,  6.48it/s]
 60%|█████▉    | 179/300 [03:11<00:47,  2.52it/s]
 60%|██████    | 181/300 [03:12<00:49,  2.38it/s]
 61%|██████▏   | 184/300 [03:13<00:42,  2.70it/s]
 62%|██████▏   | 185/300 [03:16<01:32,  1.24it/s]
 62%|██████▏   | 186/300 [03:16<01:17,  1.46it/s]
 62%|██████▏   | 187/300 [03:17<01:13,  1.53it/s]
 63%|██████▎   | 188/300 [03:17<00:59,  1.88it/s]
 63%|██████▎   | 189/300 [03:19<01:42,  1.08it/s]
 63%|██████▎   | 190/300 [03:21<02:01,  1.10s/it]
 64%|██████▎   | 191/300 [03:22<01:49,  1.01s/it]
 64%|██████▍   | 192/300 [03:28<04:19,  2.40s/it]
 64%|██████▍   | 193/300 [03:29<03:59,  2.24s/it]
 65%|██████▌   | 195/300 [03:30<02:22,  1.36s/it]
 65%|██████▌   | 196/300 [03:32<02:33,  1.47s/it]
 66%|██████▌   | 197/300 [03:32<02:09,  1.26s/it]
 66%|██████▌   | 198/300 [03:44<06:54,  4.06s/it]
 67%|██████▋   | 200/300 [03:45<04:16,  2.56s/it]
 67%|██████▋   | 202/300 [03:49<03:38,  2.23s/it]
 68%|██████▊   | 204/300 [03:49<02:23,  1.50s/it]
 68%|██████▊   | 205/300 [03:52<02:41,  1.70s/it]
 69%|██████▉   | 207/300 [03:52<01:51,  1.20s/it]
 70%|███████   | 210/300 [03:52<01:02,  1.44it/s]
 71%|███████▏  | 214/300 [03:53<00:33,  2.56it/s]
 72%|███████▏  | 216/300 [03:54<00:41,  2.03it/s]
 72%|███████▏  | 216/300 [04:05<00:41,  2.03it/s]
 72%|███████▏  | 217/300 [04:07<03:12,  2.32s/it]
 73%|███████▎  | 218/300 [04:08<02:46,  2.03s/it]
 73%|███████▎  | 219/300 [04:11<03:00,  2.22s/it]
 73%|███████▎  | 220/300 [04:11<02:23,  1.79s/it]
 74%|███████▍  | 222/300 [04:11<01:27,  1.12s/it]
 74%|███████▍  | 223/300 [04:11<01:09,  1.11it/s]
 75%|███████▍  | 224/300 [04:13<01:35,  1.25s/it]
 75%|███████▌  | 226/300 [04:14<00:56,  1.30it/s]
 76%|███████▌  | 228/300 [04:14<00:44,  1.61it/s]
 77%|███████▋  | 231/300 [04:15<00:28,  2.41it/s]
 77%|███████▋  | 232/300 [04:18<01:01,  1.10it/s]
 78%|███████▊  | 233/300 [04:21<01:24,  1.26s/it]
 78%|███████▊  | 234/300 [04:21<01:07,  1.03s/it]
 78%|███████▊  | 235/300 [04:23<01:22,  1.27s/it]
 79%|███████▊  | 236/300 [04:29<02:31,  2.37s/it]
 79%|███████▉  | 237/300 [04:30<02:17,  2.18s/it]
 79%|███████▉  | 238/300 [04:33<02:24,  2.33s/it]
 80%|███████▉  | 239/300 [04:35<02:25,  2.39s/it]
 80%|████████  | 241/300 [04:37<01:37,  1.65s/it]
 81%|████████  | 243/300 [04:37<00:58,  1.03s/it]
 82%|████████▏ | 245/300 [04:37<00:37,  1.47it/s]
 82%|████████▏ | 247/300 [04:37<00:24,  2.13it/s]
 83%|████████▎ | 249/300 [04:37<00:17,  2.99it/s]
 84%|████████▎ | 251/300 [04:38<00:12,  4.06it/s]
 84%|████████▍ | 253/300 [04:38<00:09,  5.21it/s]
 85%|████████▌ | 256/300 [04:38<00:05,  7.43it/s]
 86%|████████▌ | 258/300 [04:39<00:10,  3.99it/s]
 87%|████████▋ | 260/300 [04:41<00:16,  2.40it/s]
 87%|████████▋ | 261/300 [04:41<00:19,  1.99it/s]
 87%|████████▋ | 262/300 [04:42<00:16,  2.27it/s]
 88%|████████▊ | 263/300 [04:43<00:26,  1.42it/s]
 88%|████████▊ | 264/300 [04:47<00:51,  1.44s/it]
 88%|████████▊ | 265/300 [04:48<00:48,  1.38s/it]
 89%|████████▉ | 267/300 [04:49<00:28,  1.17it/s]
 89%|████████▉ | 268/300 [04:49<00:22,  1.41it/s]
 90%|█████████ | 271/300 [04:49<00:11,  2.42it/s]
 91%|█████████ | 273/300 [04:50<00:09,  2.90it/s]
 91%|█████████▏| 274/300 [04:50<00:08,  3.05it/s]
 92%|█████████▏| 277/300 [04:50<00:04,  5.07it/s]
 93%|█████████▎| 279/300 [04:51<00:07,  2.72it/s]
 93%|█████████▎| 280/300 [04:53<00:11,  1.81it/s]
 94%|█████████▎| 281/300 [04:53<00:09,  2.02it/s]
 95%|█████████▍| 284/300 [04:54<00:06,  2.65it/s]
 95%|█████████▌| 285/300 [04:56<00:10,  1.45it/s]
 95%|█████████▌| 286/300 [05:01<00:22,  1.58s/it]
 96%|█████████▌| 287/300 [05:02<00:18,  1.39s/it]
 97%|█████████▋| 290/300 [05:02<00:07,  1.38it/s]
 98%|█████████▊| 293/300 [05:04<00:04,  1.44it/s]
 98%|█████████▊| 295/300 [05:06<00:04,  1.23it/s]
 99%|█████████▉| 297/300 [05:08<00:02,  1.25it/s]
100%|█████████▉| 299/300 [05:08<00:00,  1.71it/s]
100%|██████████| 300/300 [05:08<00:00,  1.03s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     300       
Benchmark duration (s):                  308.31    
Total input tokens:                      2493302   
Total input text tokens:                 42902     
Total input vision tokens:               2450400   
Total generated tokens:                  153600    
Total generated tokens (retokenized):    85775     
Request throughput (req/s):              0.97      
Input token throughput (tok/s):          8087.08   
Output token throughput (tok/s):         498.21    
Peak output token throughput (tok/s):    1608.00   
Peak concurrent requests:                69        
Total token throughput (tok/s):          8585.29   
Concurrency:                             34.25     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   35202.59  
Median E2E Latency (ms):                 36165.73  
P90 E2E Latency (ms):                    45393.38  
P95 E2E Latency (ms):                    50126.94  
P99 E2E Latency (ms):                    53155.08  
---------------Time to First Token----------------
Mean TTFT (ms):                          1858.45   
Median TTFT (ms):                        1655.91   
P90 TTFT (ms):                           2660.57   
P95 TTFT (ms):                           3008.63   
P99 TTFT (ms):                           3659.69   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          65.25     
Median TPOT (ms):                        66.45     
P90 TPOT (ms):                           85.72     
P95 TPOT (ms):                           94.20     
P99 TPOT (ms):                           99.25     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           87.32     
Median ITL (ms):                         29.80     
P90 ITL (ms):                            90.67     
P95 ITL (ms):                            606.73    
P99 ITL (ms):                            715.09    
Max ITL (ms):                            1681.38   
==================================================
[Thu Jul 23 07:12:21 AM UTC 2026] Rate 1 done.
[Thu Jul 23 07:12:21 AM UTC 2026] All rates complete.